/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"btn_pay" = "Bayar";
"btn_submit" = "Kirim";
"btn_next" = "Berikutnya";
"btn_skip" = "Lewatkan";

"btn_send_sms" = "Kirim SMS";
"btn_resend_sms" = "Kirim ulang dalam \n%d detik";

/* 界面 - JP 收银台 */
"navbar_checkout_title" = "Pembayaran";
"btn_checkout_agreement" = "Saya menyetujui perjanjian JollyPay dan menyimpan data kartu ini untuk digunaka kemudian.";
"btn_checkout_agreement_highlight" = "perjanjian JollyPay";

"label_checkout_completion_time" = "Selesaikan pembyaran dalam";

"cell_label_checkout_default_tips" = "Bayar dengan kartu debit/kredit";
"cell_label_checkout_default_change" = "perubahan";
"cell_label_checkout_discount" = "Diskon";

"cell_label_paymethod_balance" = "Saldo";
"cell_label_paymethod_balance_left" = "Tersisa";
"cell_label_paymethod_balance_invalid" = "Total pesanan melebihi saldo yang tersedia";

/* 界面 - 收银台加载异常 */
"label_loadingerror_inited_title" = "Inisialisasi Gagal";
"label_loadingerror_inited_detail" = "Mohon kembali dan coba lagi.";
"btn_loadingerror_inited_operation" = "Coba kembali";

"label_loadingerror_network_title" = "OOPS";
"label_loadingerror_network_detail" = "Periksa kembali koneksi internet Anda";
"btn_loadingerror_network_operation" = "Coba kembali";

"label_loadingerror_unusual_detail" = "Maaf, akun Anda dikunci karena adanya aktifitas yang mencurigakan. Silahkan gunakan metode pembayaran lainnya.";
"btn_loadingerror_unusual_operation" = "Kembali";

/* 界面 - 银行卡组件 */
"placeholder_bankpayment_card_number" = "Nomor Kartu";
"placeholder_bankpayment_mmyy" = "Bulan/Tahun";
"placeholder_bankpayment_cvvcode" = "Kode CVV";
"placeholder_bankpayment_card_holder_name" = "Nama pada Kartu (Opsional)";

/* 界面 - 银行卡支付 */
"label_bankpayment_mada" = "Ini adalah kartu Mada";

/* 界面 - 银行卡验证 */
"label_validcard_header_title" = "Perbaharui informasi kartu";
"label_validcard_header_description" = "Opsi pembayaran di akun Anda dengan %@ yang diakhiri dengn %@ harus diperbaharui untuk menyelesaikan transaksi ini.";
"btn_validcard_delete" = "Lupa atau Kehilangan? Hapus kartu ini";
"btn_validcard_delete_highlight" = "Hapus kartu ini";
"tips_validcard_delete" = "Jika Anda ingin menghapus %@ %@, klik konfirmasi.";

/* 界面 - SADAD 支付 */
"placeholder_sadad_account" = "Masukan ID Alis pembayaran online";
"btn_sadad_change" = "Ingin mengubah?";
"label_sadad_description" = "Mohon Perhatikan:\n1. Anda dapat menggunakan SADAD untuk hampir semua Bank Arab.\n2. Pembayaran online SADAD berbeda dengan SADAD pada umumnya. Dengan metode ini Anda tidak membutuhkan 'Kode Biller'.\n\nTidak punya akun SADAD?\nTidak masalah, ikuti panduan berikut & selesaikan pembayaran Anda.\n\n1. Masuk ke rekening Anda dan subscribe SADAD.\n2. Masukkan name pengguna SADA Anda yang telah dibuat di rekening Anda.\n3. Masukkan kata sandi yang telah didaftarkan.\n4. Masukkan one time password (OTP) yang telah dikirim ke ponsel Anda.\n5. Konfirmasi dan selesaikan pembayaran.";
"lable_sadad_title" = "Total Pembayaran";

/* 界面 - 绑定手机 */
"label_bindphone_title" = "Hubungkan dengan ponsel Anda";
"label_bindphone_description" = "Demi keamanan akun Anda, hubungkan dengan nomor ponsel Anda terlebih dahulu.";
"label_bindphone_region_title" = "Wilayah";
"label_bindphone_region_value" = "Saudi Arabia";
"label_bindphone_note" = "Catatan: Kode Verifikasi akan dikirim ke nomor ponsel ketika akan melakukan pembayaran dengan kartu di akun Anda. Mohon pastikan nomor ponsel tersebut adalah milik Anda.";

/* 界面 - 选择手机国家码 */
"label_selectcountry_title" = "Silakan pilih";

/* 界面 - 验证手机号 */
"label_validphone_title" = "SMS verifikasi";
"label_validphone_description" = "Kode verifikasi telah dikirim ke : ";
"placeholder_validphone_smscode" = "Kode Verifikasi";
"placeHolder_validphone_number" = "Nomor ponsel";

/* 界面 - 支付密码设置 */
"label_setpassword_title" = "Buat kata sandi pembayaran";
"label_setpassword_description" = "Kata sandi pembayaran dibutuhkan untuk setiap pembayaran dengan kartu di akun Anda. Mohon mengeset dan mengingat kata sandi Anda.";
"label_resetpassword_title" = "Set ulang kata sandi pembayaran";
"label_comfirmpassword_title" = "Konfirmasi kata sandi pembayaran";
"label_setpassword_payment_title" = "Pengaturan Kata Sandi";
"label_couponinfo_description" = "Diskon %@ akan digunakan.";

/* 界面 - 快捷支付 */
"label_quickpayment_inputpwd_title" = "Masukkan Kata Sandi Pembayaran";
"btn_quickpayment_inputpwd_forgot" = "Lupa Kata Sandi ?";
"label_quickpayment_inputsms_title" = "SMS verifikasi";
"label_quickpayment_inputsms_description" = "Transaksi membutuhkan konfirmasi SMS. Kode verifikasi akan di kirim ke: ";

/* 界面 - 支付结果 */
"label_result_success_title" = "Selesai";
"label_result_success_detail" = "Pembayaran selesai";

"label_result_pending_title" = "Tertunda/Memproses";
"label_result_pending_detail" = "Pembayaran sedang menunggu pemrosesan. Pembayaran sedang diproses.";

"label_result_error_title" = "ERROR";
"label_result_error_detail" = "Transaksi tidak dapat dilakukan karena dana yang tidak mencukupi.";

"label_result_oops_title" = "OOPS";
"label_result_oops_detail" = "the operation was declined  because the transaction had been completed";

/* 界面 - 用户协议 */
"navbar_agreement_title" = "Perjanjian";

/* 界面 - 3DS 支付 */
"navbar_3ds_title" = "Verifikasi 3D Secure";

/* 界面 - 银行卡支付中绑卡 */
"label_payment_bindcard_note" = "Untuk menyimpang kartu ini, Anda harus memverifikasi nomor ponsel untuk membuat kata sandi pembayaran";

/* 提示信息 */
"tips_action_ok" = "OK";
"tips_action_cancel" = "Batalkan";
"tips_action_goto_setup" = "Ke Pengaturan";
"tips_action_verify_sms" = "Verifikasi memalui Kode SMS";
"tips_action_retry" = "Coba kembali";
"tips_action_confirm" = "Konfirmasi";
"tips_action_enable" = "Hidupkan";
"tips_action_enter_pwd" = "Masukkan Kata Sandi";

"tips_operation_success" = "Sukses";
"tips_operation_processing" = "Memproses";

"tips_network_timeout" = "Waktu transaksi habis karena sistem error.";
"tips_response_order_expired" = "Maaf, pesanan sudah kadaluarsa.";
"tips_response_error" = "Error Tidak Dikenal. Penyebab error tidak dapat dipastikan. Silahkan coba kembali.";

"tips_checkout_setpwd" = "Mohon untuk membuat kata sandi pembayaran sebelum membayar";

"tips_title_invalid_pwd" = "Kata sandi salah";
"tips_quickpaymentcode_invalid_twice" = "Kata sandi salah. Anda memiliki 2 kesempatan untuk mencoba atau gunakan kode verifikasi";
"tips_quickpaymentcode_invalid_once" = "Kata sandi salah. Anda memiliki 1 kesempatan untuk mencoba";

"tips_sadad_invalid_account" = "ID Alias akun SADAD harus menyertakan karakter alfanumerik dan spesial";
"tips_sadad_length_account" = "ID Alias akun SADAD harus terdiri dari minimal 6 karakter dan maksimal 12 karakter";

/* 手机号校验 */
"tips_phone_invalid_length" = "Nomor ponsel kamu harus terdiri dari %@ karakter";
"tips_phone_invalid_prefix" = "Nomor ponsel kamu harus dimulai dengan %@";
"tips_phone_invalid" = "Silahkan masukkan nomor ponsel yang valid";

"tips_verification_sended" = "Kode Verifikasi telah dikirim ke ponsel Anda.";
"tips_verification_invalid" = "Masukkan Kode Verifikasi yang valid";

"tips_password_warning_weak" = "Kata sandi terlalu lemah, silahkan ulangi";
"tips_password_error_match" = "Kata sandi tidak sesuai. Silahkan ulangi.";

"tips_payment_bankcard_notsupported" = "Maaf, kami tidak menerima kartu ini";
"tips_currency_charged_description" = "Anda akan dikenakan biaya sebesar %@";

"tips_payment_timeout" = "Waktu Transaksi Habis";

/* 生物验证 */
"tips_authid_enable_title" = "Hidupkan Face/Touch untuk JollyPay";
"tips_authid_allow_description" = "Silahkan verifikasi %@ Anda";
"tips_authid_face" = "Face ID";
"tips_authid_touch" = "Touch ID";
"tips_authid_locked" = "Membuka kunci ponsel";

/* 退出收银台 */
"tips_checkout_exit" = "Pembayaran belum selesai, teruskan atau keluar?";

/* Session 失效 */
"response_msg_session_expired" = "Maaf, waktu habis";
/* 营销系统 - 红包无效 */
"response_msg_coupon_invalid" = "Maaf, tidak dapat menggunakan kupon, silahkan coba kembali.";
/* 手机号 - 已被使用 */
"response_msg_phone_bind_used" = "Nomor ponsel sudah digunakan, silahkan gunakan nomor ponsel yang berbeda.";
/* 验证码 - 发送失败 */
"response_msg_phone_sms_send_failure" = "Gagal mengirimkan verifikasi. Silahkan coba kembali lagi.";
/* 验证码 - 手机号被锁 */
"response_msg_phone_sms_locked" = "Maaf, Anda telah gagal %@ kali. Akun Anda akan dikunci selama %@ menit.";
/* 支付 - 转汇查询超时 */
"response_msg_currency_timeout" = "Tidak dapat menampilkan kurs. Klik untuk menampilkan kembali.";
/* 支付 - 币种不支持 */
"response_msg_currency_not_supported" = "Maaf, kami tidak menerima mata uang tersebut";
/* 支付 - 预路由失败 */
"response_msg_payment_preouting_error" = "Tidak Dapat Mengalihkan Transaksi. Silahkan coba kembali.";
/* 支付 - 风控拦截 */
"response_msg_payment_intercepted" = "Transaksi tidak dapat diteruskan karena pesanan beresiko tinggi.";
/* 支付 - 支付账号被锁 */
"response_msg_payment_account_locked" = "Maaf, Anda telah gagal beberapa kali. Akun Anda akan dikunci selama %@ menit.";
/* 银行卡 - 绑卡超出范围 */
"response_msg_bankcard_bind_outrnage" = "Maaf, Anda hanya dapat menambahkan %@ kartu pada akun Anda.";
/* 银行卡 - 绑卡失败 */
"response_msg_bankcard_bind_failure" = "Gagal menambahkan data kartu";
/* 银行卡 - 重复绑卡 */
"response_msg_bankcard_bind_again" = "Data kartu sudah ditambahkan. Jangan menambahkan data lagi.";
/* 银行卡 - 更新失败 */
"response_msg_bankcard_update_failure" = "Gagal memperbaharui informasi bank.";
/* 银行卡 - 删除失败 */
"response_msg_bankcard_remove_failure" = "Gagal menghapus data kartu. Silahkan coba kembali lagi.";

// 原始
"payment_method_sadad" = "Sadad";
"payment_method_mada" = "Mada";
